export type PostType = {
    id: number;
    title: string;
    date: string;
    body: string;
}

export const Posts: PostType[] = [
    {
        id: 1,
        title: 'تفاوت بین برنامه نویسی و کدنویسی',
        date: 'دوشنبه 11 مهر 1401',
        body: `
            درود به همگی امیدوارم حالتون خوب باشه... <br /> 
            ممکنه براتون سوال باشه که برنامه نویسی چه فرقی با کدنویسی داره و متاسفانه <strong>خیلیا</strong> اشتباه بکنن و دوتارو باهم قاطی کنن
            <br />
            حالا بریم سر اصل مطلب...
            <br /> <br />
            <strong>برنامه نویس</strong> به کسی گفته میشه که یک مسئله ای رو قراره حل کنه و اون رو تبدیل کنه به یک برنامه کامپیوتری. این وسط باید اون مسئله رو تجزیه و تحلیل کنه و تبدیلش کنه به کد قابل فهم برای کامپیوتر
            <br />
            حالا <strong>کد نویس</strong> فرق داره. مسئله از قبل حل شده فقط میاد از یکسری کد آماده استفاده میکنه یا اینکه خودش تبدیل میکنه به کد.
            <br />
            حالا این وسط فرق این دوتا یک چیزه: اونم مهارت <strong>حل مسئله</strong>
            <br /><br /><br />
            درضمن این مهارت چیزی نیست که از اول باشه و فقط با تمرین و استمرار هست که این مهارت رو بشه تقویت کرد
            <br />
        `, 
    }, 
    {
        id: 2,
        title: '4 فریمورک محبوب برای CSS',
        date: 'چهارشنبه 13 مهر 1401',
        body: `
            <p dir="rtl">سلام به همگی</p>
            <p dir="rtl">امروز توی این پست قراره که یکسری<strong> فریمورک های CSS</strong> یی که طراحی وب رو براتون راحت میکنه لیستی از اونارو بیارم</p>
            <p dir="rtl"><strong><span style="font-size:20px">1 - TailwindCSS</span></strong></p>
            <p dir="rtl">بنظرم این فرمورک محبوب ترین فریموکی هست که یک طراح وب میتونه ازش بهره ببره.ویژگی مهمی که اون رو از بقیه فریمورک ها متمایز میکنه قابلیت سفارشی سازیش هست. یعنی اینکه هر تمی که برای سایتتون مدنظرتونه رو توی فایل کانفیگش اضافه کنید.</p>
            <p dir="rtl">و حتی breakpoint هاتون رو میتونید سفارشی سازیش کنید یعنی مثلا بگید سایز موبایل میخوام فلان قدر باشه یا هرسایزی</p>
            <p dir="rtl">البته یکسری مغایب هم داره مثلا برای یک تگ معمولی باید کلی استایل رو اختصاص بدی که فایل HTML ت رو شلوغ میکنه یا اینکه نمیشه به صورت داینامیک بهش کلاس بدی و باید کلاس رو به صورت مستقیم بدی</p>
            <p dir="rtl"><strong><span style="font-size:20px">2 - Bootstrap</span></strong></p>
            <p dir="rtl">نمی توان درباره فریمورک های CSS سخنی گفت که شامل Bootstrap نباشد. توییتر این فریمورک را در سال 2011 معرفی کرد تا طراحی وب پاسخگو را به راحتی در اختیار توسعه دهندگان قرار دهد.</p>
            <p dir="rtl">از آن زمان ، این پروژه برای پشتیبانی از CSS مدرن تکامل یافته و ویژگی های بی شماری را برای بهبود بهره وری پیش روی شما ارائه می دهد. همانطور که در مورد بسیاری از موارد محبوب وجود دارد ، Bootstrap انتقاداتی را نیز به همراه دارد.</p>
            <p dir="rtl"><strong><span style="font-size:20px">3 - Bulma</span></strong></p>
            <p dir="rtl">بولما Bulma یک گزینه عالی برای Bootstrap است ، زیرا دارای کد مدرن و زیبایی منحصر به فرد است. استفاده و وارد کردن به پروژه های شما آسان است و دارای اجزای مختلف از پیش ساخته شده است.</p>
            <p dir="rtl">به دلیل نحو ساده و طراحی مینیمالیستی اما زیبایی شناسانه بسیار ستوده شده است. این واقعاً فریمورکی است که می تواند یک صفحه وب کسل کننده را روشن و جذاب جلوه دهد.</p>
            <p dir="rtl">با بیش از 40،000 ستاره در GitHub ، این یک فریمورک خوب نیست ، بلکه یک نیرو است که باید حساب شود.</p>
            <p dir="rtl"><strong><span style="font-size:20px">3 - UIKit</span></strong></p>
            <p dir="rtl">یو آی کیت UIKit یک Framework ماژولار و سبک فرانت اند و css است. اگر شما هدفتان ساخت رابط&zwnj;های کاربری سریع و قدرتمند است، UIKit می&zwnj;تواند گزینه&zwnj; مناسبی برایتان باشد. این Framework مجموعه&zwnj;ای از کامپوننت&zwnj;های CSS, HTML, JS ای است. این امر باعث می&zwnj;شود که این Framework فرانت اند به سادگی سفارشی شود و به راحتی نیز قابل استفاده باشد.</p>
            <p dir="rtl">بیش از 16k ستاره در GitHub دارد و توسط توسعه دهندگان برای API آسان و طراحی برش خورده انتخاب شده است.علاوه بر این ، UIKit یک نسخه حرفه ای دارد که صفحات مضمونی را برای وردپرس و جوملا ارائه می دهد.</p>
            <p dir="rtl">یو آی کیت یکی از پر استفاده&zwnj;ترین ابزارها برای توسعه&zwnj;ی اپ&zwnj;های iOS است. این Framework کامپوننت&zwnj;های اصلی مانند دکمه&zwnj;، لیبل، جدول و ... را در خود جای داده است. می&zwnj;توان گفت که UIKit آینده&zwnj;ی توسعه&zwnj;ی اپ&zwnj; پلتفرم&zwnj;های اپل را در درست خواهد داشت.</p>
            <p>&nbsp;</p>
        `, 
    }, 
]