export type PostType = {
    id: number;
    title: string;
    date: string;
    body: string;
}

export const Posts: PostType[] = [
    {
        id: 11985,
        title: 'تفاوت بین برنامه نویسی و کدنویسی',
        date: 'دوشنبه 11 مهر 1401',
        body: `
            درود به همگی امیدوارم حالتون خوب باشه... <br /> 
            ممکنه براتون سوال باشه که برنامه نویسی چه فرقی با کدنویسی داره و متاسفانه <strong>خیلیا</strong> اشتباه بکنن و دوتارو باهم قاطی کنن
            <br />
            حالا بریم سر اصل مطلب...
            <br /> <br />
            <strong>برنامه نویس</strong> به کسی گفته میشه که یک مسئله ای رو قراره حل کنه و اون رو تبدیل کنه به یک برنامه کامپیوتری. این وسط باید اون مسئله رو تجزیه و تحلیل کنه و تبدیلش کنه به کد قابل فهم برای کامپیوتر
            <br />
            حالا <strong>کد نویس</strong> فرق داره. مسئله از قبل حل شده فقط میاد از یکسری کد آماده استفاده میکنه یا اینکه خودش تبدیل میکنه به کد.
            <br />
            حالا این وسط فرق این دوتا یک چیزه: اونم مهارت <strong>حل مسئله</strong>
            <br /><br /><br />
            درضمن این مهارت چیزی نیست که از اول باشه و فقط با تمرین و استمرار هست که این مهارت رو بشه تقویت کرد
            <br />
        `, 
    }, 
]