export type ServiceType = {
  title: string;
  description: string;
};

export const ServicesData: ServiceType[] = [
  {
    title: "توسعه پروژه های React و NextJS",
    description: "اگر پروژه ای دارین که قراره با ریکت یا نکست توسعه داده بشه و کیفیت کار هم براتون مهمه میتونید روی من حساب کنید",
  },
  {
    title: "پیاده سازی قالب سایت",
    description: "پروژه ای دارین که میخواین خیلی ساده و بدون فریمورک خاصی پیش ببرید. در این مورد میتونید باهام درمیون بذارید",
  },
  {
    title: "تولید محتوای تخصصی",
    description: "تولید محتوای تخصصی چه ویدیویی و چه متنی کاری هست که در حین انجام دادنش بهم حس خوبی میده و یکی از اهدافم اینه که تاثیری توی کامیونیتی فارسی داشته باشم.",
  },
  {
    title: "مشاوره و منتورینگ",
    description: "اگر هدفت یادگیری و تقویت برنامه نویسی هست میتونم با توجه به تجربیاتی که توی کار داشتم رو قدم به قدم باهات درمیون بذارم",
  },
  {
    title: "تدریس خصوصی و نیمه خصوصی",
    description: "تدریس یکی از کارهاییه که خیلی خوب از پسش برمیام و درطول فرایند یادگیری فرانت میتونی روی کمکم حساب کنی. برای اینکه با سبک تدریسم آشنا بشی سری به ویدیو های یوتیوبم بزن 😁",
  },
];
